wrk/sync_res/wrk_get.txt
Running 20s test @ http://127.0.0.1:8080
  2 threads and 1024 connections
  Thread calibration: mean lat.: 0.763ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.772ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   759.57us  299.78us   2.34ms   59.29%
    Req/Sec     3.50k   368.92     4.67k    63.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  747.00us
 75.000%    1.03ms
 90.000%    1.16ms
 99.000%    1.30ms
 99.900%    1.37ms
 99.990%    1.88ms
 99.999%    2.34ms
100.000%    2.34ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.167     0.000000            1         1.00
       0.349     0.100000         4951         1.11
       0.459     0.200000         9929         1.25
       0.545     0.300000        14799         1.43
       0.657     0.400000        19753         1.67
       0.747     0.500000        24654         2.00
       0.822     0.550000        27140         2.22
       0.861     0.600000        29625         2.50
       0.899     0.650000        32081         2.86
       0.959     0.700000        34520         3.33
       1.029     0.750000        36996         4.00
       1.048     0.775000        38227         4.44
       1.066     0.800000        39495         5.00
       1.083     0.825000        40684         5.71
       1.103     0.850000        41934         6.67
       1.128     0.875000        43165         8.00
       1.143     0.887500        43760         8.89
       1.162     0.900000        44364        10.00
       1.185     0.912500        44990        11.43
       1.207     0.925000        45603        13.33
       1.227     0.937500        46225        16.00
       1.236     0.943750        46566        17.78
       1.243     0.950000        46854        20.00
       1.251     0.956250        47159        22.86
       1.259     0.962500        47478        26.67
       1.266     0.968750        47757        32.00
       1.271     0.971875        47919        35.56
       1.276     0.975000        48085        40.00
       1.281     0.978125        48246        45.71
       1.286     0.981250        48382        53.33
       1.292     0.984375        48540        64.00
       1.295     0.985938        48613        71.11
       1.298     0.987500        48675        80.00
       1.303     0.989062        48761        91.43
       1.307     0.990625        48832       106.67
       1.312     0.992188        48906       128.00
       1.315     0.992969        48946       142.22
       1.319     0.993750        48993       160.00
       1.322     0.994531        49025       182.86
       1.325     0.995313        49060       213.33
       1.330     0.996094        49100       256.00
       1.332     0.996484        49117       284.44
       1.336     0.996875        49140       320.00
       1.340     0.997266        49158       365.71
       1.344     0.997656        49175       426.67
       1.350     0.998047        49195       512.00
       1.355     0.998242        49206       568.89
       1.357     0.998437        49213       640.00
       1.363     0.998633        49224       731.43
       1.367     0.998828        49233       853.33
       1.375     0.999023        49242      1024.00
       1.379     0.999121        49248      1137.78
       1.385     0.999219        49252      1280.00
       1.388     0.999316        49258      1462.86
       1.396     0.999414        49262      1706.67
       1.401     0.999512        49266      2048.00
       1.404     0.999561        49270      2275.56
       1.405     0.999609        49271      2560.00
       1.409     0.999658        49274      2925.71
       1.416     0.999707        49276      3413.33
       1.421     0.999756        49278      4096.00
       1.427     0.999780        49280      4551.11
       1.428     0.999805        49281      5120.00
       1.458     0.999829        49282      5851.43
       1.463     0.999854        49283      6826.67
       1.588     0.999878        49284      8192.00
       1.881     0.999890        49285      9102.22
       1.991     0.999902        49286     10240.00
       1.991     0.999915        49286     11702.86
       2.013     0.999927        49287     13653.33
       2.013     0.999939        49287     16384.00
       2.119     0.999945        49288     18204.44
       2.119     0.999951        49288     20480.00
       2.119     0.999957        49288     23405.71
       2.221     0.999963        49289     27306.67
       2.221     0.999969        49289     32768.00
       2.221     0.999973        49289     36408.89
       2.221     0.999976        49289     40960.00
       2.221     0.999979        49289     46811.43
       2.339     0.999982        49290     54613.33
       2.339     1.000000        49290          inf
#[Mean    =        0.760, StdDeviation   =        0.300]
#[Max     =        2.338, Total count    =        49290]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  135986 requests in 20.00s, 8.67MB read
  Socket errors: connect 5, read 0, write 0, timeout 2212
Requests/sec:   6799.70
Transfer/sec:    443.83KB