wrk/sync_res/wrk_put.txt
Running 20s test @ http://127.0.0.1:8080
  2 threads and 1024 connections
  Thread calibration: mean lat.: 0.826ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.829ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   830.19us  302.49us   3.22ms   59.99%
    Req/Sec     2.76k   473.77     4.00k    69.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  815.00us
 75.000%    1.10ms
 90.000%    1.23ms
 99.000%    1.39ms
 99.900%    1.48ms
 99.990%    2.33ms
 99.999%    3.22ms
100.000%    3.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.205     0.000000            1         1.00
       0.410     0.100000         3911         1.11
       0.530     0.200000         7791         1.25
       0.615     0.300000        11695         1.43
       0.730     0.400000        15610         1.67
       0.815     0.500000        19463         2.00
       0.893     0.550000        21421         2.22
       0.936     0.600000        23361         2.50
       0.972     0.650000        25297         2.86
       1.025     0.700000        27249         3.33
       1.096     0.750000        29184         4.00
       1.119     0.775000        30178         4.44
       1.138     0.800000        31189         5.00
       1.156     0.825000        32121         5.71
       1.174     0.850000        33119         6.67
       1.195     0.875000        34065         8.00
       1.209     0.887500        34546         8.89
       1.227     0.900000        35015        10.00
       1.251     0.912500        35509        11.43
       1.276     0.925000        36010        13.33
       1.297     0.937500        36479        16.00
       1.307     0.943750        36726        17.78
       1.317     0.950000        36980        20.00
       1.326     0.956250        37214        22.86
       1.338     0.962500        37465        26.67
       1.347     0.968750        37702        32.00
       1.352     0.971875        37834        35.56
       1.356     0.975000        37939        40.00
       1.361     0.978125        38062        45.71
       1.368     0.981250        38187        53.33
       1.375     0.984375        38313        64.00
       1.378     0.985938        38358        71.11
       1.382     0.987500        38420        80.00
       1.387     0.989062        38491        91.43
       1.393     0.990625        38545       106.67
       1.399     0.992188        38607       128.00
       1.403     0.992969        38634       142.22
       1.408     0.993750        38663       160.00
       1.414     0.994531        38702       182.86
       1.418     0.995313        38725       213.33
       1.424     0.996094        38755       256.00
       1.428     0.996484        38771       284.44
       1.433     0.996875        38784       320.00
       1.438     0.997266        38799       365.71
       1.445     0.997656        38814       426.67
       1.452     0.998047        38832       512.00
       1.454     0.998242        38837       568.89
       1.459     0.998437        38845       640.00
       1.465     0.998633        38852       731.43
       1.478     0.998828        38861       853.33
       1.485     0.999023        38868      1024.00
       1.495     0.999121        38871      1137.78
       1.504     0.999219        38875      1280.00
       1.531     0.999316        38879      1462.86
       1.543     0.999414        38883      1706.67
       1.688     0.999512        38887      2048.00
       1.740     0.999561        38888      2275.56
       1.906     0.999609        38890      2560.00
       1.929     0.999658        38893      2925.71
       1.947     0.999707        38894      3413.33
       2.113     0.999756        38896      4096.00
       2.123     0.999780        38897      4551.11
       2.189     0.999805        38898      5120.00
       2.199     0.999829        38899      5851.43
       2.315     0.999854        38900      6826.67
       2.325     0.999878        38901      8192.00
       2.325     0.999890        38901      9102.22
       2.405     0.999902        38902     10240.00
       2.405     0.999915        38902     11702.86
       2.547     0.999927        38903     13653.33
       2.547     0.999939        38903     16384.00
       2.547     0.999945        38903     18204.44
       2.593     0.999951        38904     20480.00
       2.593     0.999957        38904     23405.71
       2.593     0.999963        38904     27306.67
       2.593     0.999969        38904     32768.00
       2.593     0.999973        38904     36408.89
       3.217     0.999976        38905     40960.00
       3.217     1.000000        38905          inf
#[Mean    =        0.830, StdDeviation   =        0.302]
#[Max     =        3.216, Total count    =        38905]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  102836 requests in 20.00s, 6.57MB read
  Socket errors: connect 5, read 0, write 0, timeout 3708
Requests/sec:   5141.63
Transfer/sec:    336.42KB