wrk/sync_res/wrk_put_under_status.txt
Running 30s test @ http://127.0.0.1:8080
  2 threads and 1024 connections
  Thread calibration: mean lat.: 0.816ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.809ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   819.70us  326.47us  13.62ms   65.06%
    Req/Sec     2.83k   528.54     4.33k    69.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  808.00us
 75.000%    1.08ms
 90.000%    1.23ms
 99.000%    1.40ms
 99.900%    1.64ms
 99.990%    7.27ms
 99.999%   13.30ms
100.000%   13.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.168     0.000000            1         1.00
       0.403     0.100000         9357         1.11
       0.515     0.200000        18742         1.25
       0.606     0.300000        28016         1.43
       0.713     0.400000        37423         1.67
       0.808     0.500000        46735         2.00
       0.872     0.550000        51422         2.22
       0.921     0.600000        56060         2.50
       0.964     0.650000        60705         2.86
       1.020     0.700000        65376         3.33
       1.080     0.750000        70086         4.00
       1.104     0.775000        72424         4.44
       1.125     0.800000        74696         5.00
       1.147     0.825000        77088         5.71
       1.169     0.850000        79437         6.67
       1.195     0.875000        81746         8.00
       1.210     0.887500        82874         8.89
       1.227     0.900000        84056        10.00
       1.246     0.912500        85237        11.43
       1.266     0.925000        86419        13.33
       1.286     0.937500        87559        16.00
       1.296     0.943750        88148        17.78
       1.306     0.950000        88730        20.00
       1.316     0.956250        89289        22.86
       1.328     0.962500        89890        26.67
       1.339     0.968750        90459        32.00
       1.346     0.971875        90788        35.56
       1.352     0.975000        91060        40.00
       1.359     0.978125        91357        45.71
       1.367     0.981250        91640        53.33
       1.376     0.984375        91921        64.00
       1.381     0.985938        92058        71.11
       1.387     0.987500        92203        80.00
       1.394     0.989062        92363        91.43
       1.401     0.990625        92509       106.67
       1.408     0.992188        92641       128.00
       1.414     0.992969        92713       142.22
       1.420     0.993750        92791       160.00
       1.426     0.994531        92860       182.86
       1.435     0.995313        92934       213.33
       1.446     0.996094        93005       256.00
       1.452     0.996484        93042       284.44
       1.461     0.996875        93082       320.00
       1.469     0.997266        93118       365.71
       1.479     0.997656        93154       426.67
       1.496     0.998047        93186       512.00
       1.512     0.998242        93204       568.89
       1.528     0.998437        93224       640.00
       1.548     0.998633        93241       731.43
       1.580     0.998828        93259       853.33
       1.657     0.999023        93277      1024.00
       1.780     0.999121        93286      1137.78
       1.969     0.999219        93296      1280.00
       2.165     0.999316        93305      1462.86
       2.379     0.999414        93314      1706.67
       2.635     0.999512        93323      2048.00
       2.815     0.999561        93327      2275.56
       3.137     0.999609        93332      2560.00
       3.649     0.999658        93337      2925.71
       3.749     0.999707        93341      3413.33
       4.041     0.999756        93346      4096.00
       4.695     0.999780        93348      4551.11
       5.199     0.999805        93350      5120.00
       5.623     0.999829        93353      5851.43
       5.847     0.999854        93355      6826.67
       6.459     0.999878        93357      8192.00
       7.019     0.999890        93358      9102.22
       7.271     0.999902        93359     10240.00
       8.003     0.999915        93361     11702.86
       8.047     0.999927        93362     13653.33
       8.111     0.999939        93363     16384.00
       8.111     0.999945        93363     18204.44
       8.327     0.999951        93364     20480.00
       8.767     0.999957        93365     23405.71
       8.767     0.999963        93365     27306.67
      10.551     0.999969        93366     32768.00
      10.551     0.999973        93366     36408.89
      10.551     0.999976        93366     40960.00
      13.303     0.999979        93367     46811.43
      13.303     0.999982        93367     54613.33
      13.303     0.999985        93367     65536.00
      13.303     0.999986        93367     72817.78
      13.303     0.999988        93367     81920.00
      13.623     0.999989        93368     93622.86
      13.623     1.000000        93368          inf
#[Mean    =        0.820, StdDeviation   =        0.326]
#[Max     =       13.616, Total count    =        93368]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  159312 requests in 30.00s, 10.18MB read
  Socket errors: connect 5, read 0, write 0, timeout 5924
Requests/sec:   5310.24
Transfer/sec:    347.45KB